lemmingDev/ESP32-BLE-Gamepad/BleGamepad.cpp
        // Logical Min (1)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

        // Logical Max (8)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x08;

        // Physical Min (0)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x35;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

        // Physical Max (315)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x46;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x3B;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

        // Unit (SI Rot : Ang Pos)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x65;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x12;

        // Report Size (8)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x08;

        // Report Count (4)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
        tempHidReportDescriptor[hidReportDescriptorSize++] = configuration.getHatSwitchCount();

        // Input (Data, Variable, Absolute)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x42;

        // END_COLLECTION (Physical)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0xc0;
    }

    if (configuration.getEnableOutputReport()){
        // Usage Page (Vendor Defined 0xFF00)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x06;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0xFF;

        // Usage (Vendor Usage 0x01)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

        // Usage (0x01)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

        // Logical Minimum (0)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

        // Logical Maximum (255)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x26;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0xFF;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

        // Report Size (8 bits)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x08;

        if(configuration.getOutputReportLength()<=0xFF){
            // Report Count (0~255 bytes)
            tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
            tempHidReportDescriptor[hidReportDescriptorSize++] = configuration.getOutputReportLength();
        }else{
            // Report Count (0~65535 bytes)
            tempHidReportDescriptor[hidReportDescriptorSize++] = 0x96;
            tempHidReportDescriptor[hidReportDescriptorSize++] = lowByte(configuration.getOutputReportLength());
            tempHidReportDescriptor[hidReportDescriptorSize++] = highByte(configuration.getOutputReportLength());
        }
        
        // Output (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x91;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;
    }

    // END_COLLECTION (Application)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xc0;

    // Set task priority from 5 to 1 in order to get ESP32-C3 working
    xTaskCreate(this->taskServer, "server", 20000, (void *)this, 1, NULL);
}

void BleGamepad::end(void)
{
}

void BleGamepad::setAxes(int16_t x, int16_t y, int16_t z, int16_t rZ, int16_t rX, int16_t rY, int16_t slider1, int16_t slider2)
{
    if (x < axesMin)
    {
        x = axesMin;
    }
    if (y < axesMin)
    {
        y = axesMin;
    }
    if (z < axesMin)
    {
        z = axesMin;
    }
    if (rZ < axesMin)
    {
        rZ = axesMin;
    }
    if (rX < axesMin)
    {
        rX = axesMin;
    }
    if (rY < axesMin)
    {
        rY = axesMin;
    }
    if (slider1 < axesMin)
    {
        slider1 = axesMin;
    }
    if (slider2 < axesMin)
    {
        slider2 = axesMin;
    }
	
    if (x > axesMax)
    {
        x = axesMax;
    }
    if (y > axesMax)
    {
        y = axesMax;
    }
    if (z > axesMax)
    {
        z = axesMax;
    }
    if (rZ > axesMax)
    {
        rZ = axesMax;
    }
    if (rX > axesMax)
    {
        rX = axesMax;
    }
    if (rY > axesMax)
    {
        rY = axesMax;
    }
    if (slider1 > axesMax)
    {
        slider1 = axesMax;
    }
    if (slider2 > axesMax)
    {
        slider2 = axesMax;
    }

    _x = x;
    _y = y;
    _z = z;
    _rZ = rZ;
    _rX = rX;
    _rY = rY;
    _slider1 = slider1;
    _slider2 = slider2;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setSimulationControls(int16_t rudder, int16_t throttle, int16_t accelerator, int16_t brake, int16_t steering)
{
    if (rudder < simulationMin)
    {
        rudder = simulationMin;
    }
    if (throttle < simulationMin)
    {
        throttle = simulationMin;
    }
    if (accelerator < simulationMin)
    {
        accelerator = simulationMin;
    }
    if (brake < simulationMin)
    {
        brake = simulationMin;
    }
    if (steering < simulationMin)
    {
        steering = simulationMin;
    }
	
    if (rudder > simulationMax)
    {
        rudder = simulationMax;
    }
    if (throttle > simulationMax)
    {
        throttle = simulationMax;
    }
    if (accelerator > simulationMax)
    {
        accelerator = simulationMax;
    }
    if (brake > simulationMax)
    {
        brake = simulationMax;
    }
    if (steering > simulationMax)
    {
        steering = simulationMax;
    }

    _rudder = rudder;
    _throttle = throttle;
    _accelerator = accelerator;
    _brake = brake;
    _steering = steering;

