lemmingDev/ESP32-BLE-Gamepad/BleGamepad.cpp
void BleGamepad::pressBack()
{
    pressSpecialButton(BACK_BUTTON);
}

void BleGamepad::releaseBack()
{
    releaseSpecialButton(BACK_BUTTON);
}

void BleGamepad::pressVolumeInc()
{
    pressSpecialButton(VOLUME_INC_BUTTON);
}

void BleGamepad::releaseVolumeInc()
{
    releaseSpecialButton(VOLUME_INC_BUTTON);
}

void BleGamepad::pressVolumeDec()
{
    pressSpecialButton(VOLUME_DEC_BUTTON);
}

void BleGamepad::releaseVolumeDec()
{
    releaseSpecialButton(VOLUME_DEC_BUTTON);
}

void BleGamepad::pressVolumeMute()
{
    pressSpecialButton(VOLUME_MUTE_BUTTON);
}

void BleGamepad::releaseVolumeMute()
{
    releaseSpecialButton(VOLUME_MUTE_BUTTON);
}

void BleGamepad::setLeftThumb(int16_t x, int16_t y)
{
    if (x < axesMin)
    {
        x = axesMin;
    }
    if (y < axesMin)
    {
        y = axesMin;
    }
	
    if (x > axesMax)
    {
        x = axesMax;
    }
    if (y > axesMax)
    {
        y = axesMax;
    }

    _x = x;
    _y = y;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setRightThumb(int16_t z, int16_t rZ)
{
    if (z < axesMin)
    {
        z = axesMin;
    }
    if (rZ < axesMin)
    {
        rZ = axesMin;
    }
	
    if (z > axesMax)
    {
        z = axesMax;
    }
    if (rZ > axesMax)
    {
        rZ = axesMax;
    }

    _z = z;
    _rZ = rZ;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setLeftTrigger(int16_t rX)
{
    if (rX < axesMin)
    {
        rX = axesMin;
    }
	
    if (rX > axesMax)
    {
        rX = axesMax;
    }

    _rX = rX;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setRightTrigger(int16_t rY)
{
    if (rY < axesMin)
    {
        rY = axesMin;
    }
	
    if (rY > axesMax)
    {
        rY = axesMax;
    }

    _rY = rY;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setTriggers(int16_t rX, int16_t rY)
{
    if (rX < axesMin)
    {
        rX = axesMin;
    }
	
    if (rY < axesMin)
    {
        rY = axesMin;
    }
	
    if (rX > axesMax)
    {
        rX = axesMax;
    }
	
    if (rY > axesMax)
    {
        rY = axesMax;
    }

    _rX = rX;
    _rY = rY;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setHat(signed char hat)
{
    _hat1 = hat;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setHat1(signed char hat1)
{
    _hat1 = hat1;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setHat2(signed char hat2)
{
    _hat2 = hat2;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setHat3(signed char hat3)
{
    _hat3 = hat3;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setHat4(signed char hat4)
{
    _hat4 = hat4;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setX(int16_t x)
{
    if (x < axesMin)
    {
        x = axesMin;
    }
	
    if (x > axesMax)
    {
        x = axesMax;
    }

    _x = x;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setY(int16_t y)
{
    if (y < axesMin)
    {
        y = axesMin;
    }
	
    if (y > axesMax)
    {
        y = axesMax;
    }

    _y = y;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setZ(int16_t z)
{
    if (z < axesMin)
    {
        z = axesMin;
    }
	
    if (z > axesMax)
    {
        z = axesMax;
    }

    _z = z;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setRZ(int16_t rZ)
{
    if (rZ < axesMin)
    {
        rZ = axesMin;
    }
	
    if (rZ > axesMax)
    {
        rZ = axesMax;
    }

    _rZ = rZ;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setRX(int16_t rX)
{
    if (rX < axesMin)
    {
        rX = axesMin;
    }
	
    if (rX > axesMax)
    {
        rX = axesMax;
    }

    _rX = rX;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setRY(int16_t rY)
{
    if (rY < axesMin)
    {
        rY = axesMin;
    }
	
    if (rY > axesMax)
    {
        rY = axesMax;
    }

    _rY = rY;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setSlider(int16_t slider)
{
    if (slider < axesMin)
    {
        slider = axesMin;
    }
	
   if (slider > axesMax)
    {
        slider = axesMax;
    }

    _slider1 = slider;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setSlider1(int16_t slider1)
{
    if (slider1 < axesMin)
    {
        slider1 = axesMin;
    }
	
    if (slider1 > axesMax)
    {
        slider1 = axesMax;
    }

    _slider1 = slider1;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setSlider2(int16_t slider2)
{
    if (slider2 < axesMin)
    {
        slider2 = axesMin;
    }
	
    if (slider2 > axesMax)
    {
        slider2 = axesMax;
    }

    _slider2 = slider2;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setRudder(int16_t rudder)
{
    if (rudder < simulationMin)
    {
        rudder = simulationMin;
    }
	
    if (rudder > simulationMax)
    {
        rudder = simulationMax;
    }

    _rudder = rudder;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setThrottle(int16_t throttle)
{
    if (throttle < simulationMin)
    {
        throttle = simulationMin;
    }
	
    if (throttle > simulationMax)
    {
        throttle = simulationMax;
    }

    _throttle = throttle;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setAccelerator(int16_t accelerator)
{
    if (accelerator < simulationMin)
    {
        accelerator = simulationMin;
    }
	
    if (accelerator > simulationMax)
    {
        accelerator = simulationMax;
    }

    _accelerator = accelerator;

